{
  "introduction": "Ingénieur en développement polyvalent, j'ai forgé mon expertise à travers des projets d'envergure pour des entreprises variées, où j'ai démontré ma capacité à mener des projets dans des environnements complexes et exigeants. Avec un sens aigu de la performance, de la résilience et de la qualité, je suis motivé par des missions où la personnalisation, la sécurité et la modularité sont essentielles. Ma capacité d'adaptation et mon souci du détail m'ont permis de contribuer efficacement, en respectant des contraintes strictes et en répondant aux objectifs de croissance et d'innovation de mes clients.",
  "experiences": [
    {
      "entreprise": "Saint Gobain",
      "poste": "Frontend Lead Developer",
      "typeContrat": "Freelance",
      "lieu": "Paris",
      "dateDebut": "2023-01-01",
      "dateFin": "2024-10-01",
      "description": "Chargé de développer la V2 d'un intranet internationnal, j’ai contribué à finaliser un projet essentiel pour Saint-Gobain, facilitant la création des cahiers des charges pour les pièces produites par ses équipes à travers le monde. Dans un environnement utilisant Angular, Angular Material, TypeScript, Sass et Figma, j’ai apporté mon expertise en surchage de composants Angular Material, permettant un haut niveau de personnalisation visuelle et fonctionnelle. Mon implication dans le projet, déjà en cours, a permis de respecter les délais et de fournir une solution ergonomique et adaptée aux besoins internationaux de l'entreprise.",
      "competences": [
        "HTML/CSS",
        "Angular",
        "Angular Material",
        "SCRUM",
        "Figma",
        "TypeScript",
        "Javascript",
        "SCSS",
        "PDF",
        "JWT"
      ]
    },
    {
      "entreprise": "Veloo",
      "poste": "Fullstack Developer",
      "typeContrat": "Freelance",
      "lieu": "Strasbourg",
      "dateDebut": "2022-07-01",
      "dateFin": "2022-10-01",
      "description": "Chargé du développement d'un site vitrine en Angular, conçu pour présenter les services de l'entreprise, et de la création de composants sur Shopify pour la partie boutique, le tout déployé sur AWS (Lambda, S3). En travaillant avec Angular Universal, Shopify, et Figma, j'ai contribué à la finalisation du projet dans les délais. J'ai réalisé une intégration en CSS minutieuse pour atteindre un rendu proche du pixel perfect, aligné avec les maquettes Figma, renforçant ainsi mes compétences en design précis et en intégration front-end.",
      "competences": [
        "HTML/CSS",
        "Angular",
        "Angular Material",
        "Angular Universal",
        "AWS Lambda",
        "AWS S3",
        "AWS CloudFront",
        "AWS DynamoDB",
        "SCRUM",
        "Figma",
        "TypeScript",
        "Javascript",
        "SCSS",
        "Shopify"
      ]
    },
    {
      "entreprise": "Logitud",
      "poste": "Fullstack Developer",
      "typeContrat": "Freelance",
      "lieu": "Mulhouse",
      "dateDebut": "2021-02-01",
      "dateFin": "2022-07-01",
      "description": "Participation au développement d'une plateforme pour les communes, permettant de gérer les campagnes électorales en France, ainsi qu'à la mise en place de microservices en Node.js pour la synchronisation avec des API étatiques comme celle de l'INSEE. Le projet utilisait Angular, Node.js, TypeScript, Docker et PostgreSQL & MongoDB, intégrant également la génération de documents PDF et une validation de qualité via Sonar. Reprenant un projet existant nécessitant des optimisations, j'ai contribué à finaliser le projet dans les délais en répondant à des contraintes de performance strictes, particulièrement critiques lors des périodes électorales.",
      "competences": [
        "HTML/CSS",
        "Angular",
        "Angular Material",
        "NodeJS",
        "NodeJS Cluster",
        "ExpressJS",
        "TypeScript",
        "Javascript",
        "SCSS",
        "Postman",
        "PostgreSQL",
        "Docker",
        "Nginx Reverse Proxy",
        "Load Balancing",
        "MongoDB",
        "Mongoose",
        "SonarQube",
        "PDF",
        "API Restful",
        "Microservices",
        "Logstash",
        "Kibana",
        "Elastic",
        "Winston",
        "Pino",
        "JWT"
      ]
    },
    {
      "entreprise": "Mutuelle Nationale Territoriale",
      "poste": "Backend Developper",
      "typeContrat": "Freelance",
      "lieu": "Paris",
      "dateDebut": "2019-05-01",
      "dateFin": "2020-03-01",
      "description": "Développement de services web en Node.js pour la synchronisation des données entre les API de la MNT et celles de prestataires externes. Projet initié from scratch, incluant la création de modules Node.js réutilisables pour les interactions front-end. Dans un contexte soumis à des contraintes de sécurité strictes pour la protection des données médicales, j'ai intégré Kafka pour un traitement systématique et sécurisé des informations sensibles, garantissant ainsi conformité et efficacité dans le traitement des données.",
      "competences": [
        "Angular",
        "ExpressJS",
        "KoaJS",
        "SCRUM",
        "TypeScript",
        "Javascript",
        "Insomnia",
        "Postman",
        "MongoDB",
        "PDF",
        "Microservices",
        "API Restful",
        "Redis",
        "KeyCloak",
        "Kafka",
        "JWT",
        "XML"
      ]
    },
    {
      "entreprise": "Publicis Sapient",
      "poste": "Frontend Developer",
      "typeContrat": "CDI",
      "lieu": "Paris",
      "dateDebut": "2018-01-01",
      "dateFin": "2019-04-01",
      "description": "Participation à la refonte du site de l'Agence du Service Civique, au sein d'une équipe dirigée par un architecte. En utilisant Angular, Angular Universal, Bulma CSS, et GraphQL, j'ai contribué à la création de composants en atomic design, offrant une approche modulaire et réutilisable du développement. Cette mission m'a permis d'approfondir mes compétences en Angular et d'explorer le framework CSS Bulma ainsi que l'interfaçage d'API via Apollo GraphQL, renforçant ainsi ma polyvalence en développement frontend.",
      "competences": [
        "Angular",
        "HTML/CSS",
        "Angular Material",
        "Angular Universal",
        "Apollo GraphQL",
        "GraphQL",
        "Bulma CSS",
        "Atomic Design",
        "SCRUM",
        "Figma",
        "TypeScript",
        "Javascript",
        "SCSS",
        "Wordpress",
        "Story Book",
        "JWT"
      ]
    },
    {
      "entreprise": "Sarenza",
      "poste": "Frontend Developer",
      "typeContrat": "CDD",
      "lieu": "Paris",
      "dateDebut": "2017-07-01",
      "dateFin": "2017-12-01",
      "description": "Administration et développement frontend pour un site e-commerce multilingue sous un CMS maison en .NET, dédié à la vente de chaussures et d’accessoires. Utilisant HTML/CSS et JavaScript, j'ai intégré des outils d'analyse et d'optimisation, notamment Google Analytics, Google Tag Manager, et Google Optimize pour des campagnes d’A/B testing. J'ai également mis en place des notifications push via WonderPush, contribuant ainsi à améliorer l'engagement utilisateur et les performances marketing.",
      "competences": [
        "Javascript",
        ".NET",
        "HTML/CSS",
        "SCRUM",
        "Kanban",
        "Google Analitics",
        "Google Optimize",
        "Google Tag Manager",
        "A/B Testing",
        "AT Internet Xiti",
        "Wonder Push",
        "TypeScript"
      ]
    },
    {
      "entreprise": "Nanotera",
      "poste": "Fullstack Developer",
      "typeContrat": "CDI",
      "lieu": "Wittelsheim",
      "dateDebut": "2014-07-01",
      "dateFin": "2017-06-01",
      "description": "Responsable de projets pour le client Système U, notamment de la digitalisation des catalogues papier en AngularJS et de la refonte du site \"Menu Traiteur Fin d'Année\". Sur ce dernier, j'ai reconstruit le front-end en AngularJS et effectué une refonte majeure des serveurs de commande en PHP Symfony. Ce site, soumis à des exigences strictes de performance et de résilience pour un chiffre d'affaires annuel de plusieurs millions d'euros généré en seulement 6 semaines, fonctionne encore chaque année depuis 2014, attestant de sa solidité et de la qualité de développement.",
      "competences": [
        "AngularJS",
        "SCRUM",
        "Google Analitics",
        "Google Tag Manager",
        "AT Internet Xiti",
        "PHP",
        "HTML/CSS",
        "Symfony",
        "MySQL",
        "Go",
        "BoltDB",
        "NodeJS",
        "Webpack",
        "TypeScript",
        "Javascript",
        "LESS",
        "SASS",
        "PDF",
        "Wordpress",
        "XML",
        "MariaDB"
      ]
    }
  ]
}
